app/controllers/pins_controller.rb

INSERT INTO "pins" ("created_at", "latitude", "longitude", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-29 22:39:19.695826"], ["latitude", 38.80975079723835], ["longitude", -77.2569751739502], ["updated_at", "2014-09-29 22:39:19.695826"]]
---
def create
	@pin = Pin.new(pin_params)
  if @pin.save